app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Third title"], ["summary", "Third summary"], ["body", "Third body"], ["created_at", "2017-05-19 16:20:31.174776"], ["updated_at", "2017-05-19 16:20:31.174776"]]
---
	def create
		@post = Post.new(post_params)
		if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "summary" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "First title111"], ["summary", "First summarycc"], ["body", "First body!!!"], ["updated_at", "2017-05-19 16:34:57.186353"], ["id", 1]]
---
	def update
		@post = Post.find(params[:id])
		if @post.update_attributes(post_params)